In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

### Reindex of Series

In [3]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
# 自动填充 0
obj.reindex(['a','b','c','d','e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [5]:
# 插值 ffill, bfill
obj3 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### Reindex of DataFrame

In [6]:
import numpy as np

In [7]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns=['Ohio', 'Texas', 'Cal'])

In [8]:
frame

   Ohio  Texas  Cal
a     0      1    2
c     3      4    5
d     6      7    8

In [9]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  Cal
a   0.0    1.0  2.0
b   NaN    NaN  NaN
c   3.0    4.0  5.0
d   6.0    7.0  8.0

In [10]:
states = ['Texas', 'Utah', 'Cal']
frame.reindex(columns = states)

   Texas  Utah  Cal
a      1   NaN    2
c      4   NaN    5
d      7   NaN    8

### Drop

#### Series

In [11]:
obj = Series(np.arange(5.), index=list('abcde'))
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [13]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

#### DataFrame

In [14]:
frame = DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns=['Ohio', 'Texas', 'Cal'])
frame

   Ohio  Texas  Cal
a     0      1    2
c     3      4    5
d     6      7    8

In [15]:
frame.drop(['c','d'])

   Ohio  Texas  Cal
a     0      1    2

In [16]:
# use parameter axis to indecate wether the axis will be searched.
frame.drop(['Ohio'], axis=1)

   Texas  Cal
a      1    2
c      4    5
d      7    8

### Index of DataFrame

In [17]:
frame = DataFrame(np.arange(16).reshape((4,4)), index = ['a','b', 'c', 'd'], columns=['Ohio', 'Texas', 'Cal', 'Aa'])
frame

   Ohio  Texas  Cal  Aa
a     0      1    2   3
b     4      5    6   7
c     8      9   10  11
d    12     13   14  15

In [18]:
# select columns with '' value
frame['Ohio']

a     0
b     4
c     8
d    12
Name: Ohio, dtype: int64

In [19]:
# select rows without '' value(or scalar)
frame[:2]

   Ohio  Texas  Cal  Aa
a     0      1    2   3
b     4      5    6   7

In [20]:
# select both row and column
frame.loc[['d','a'], ['Ohio', 'Texas']]

   Ohio  Texas
d    12     13
a     0      1

### Functions applied for row or column

In [21]:
frame = DataFrame(np.arange(16).reshape((4,4)), index = ['a','b', 'c', 'd'], columns=['Ohio', 'Texas', 'Cal', 'Aa'])
frame

   Ohio  Texas  Cal  Aa
a     0      1    2   3
b     4      5    6   7
c     8      9   10  11
d    12     13   14  15

In [22]:
f = lambda x: x.max() - x.min()

In [23]:
frame.apply(f)

Ohio     12
Texas    12
Cal      12
Aa       12
dtype: int64

In [24]:
# use parameter axis to indecate axis
# axis = 0 (default) will apply f on vertical
# axis = 1 on horizontial
frame.apply(f, axis=1)

a    3
b    3
c    3
d    3
dtype: int64

### 汇总和统计

In [25]:
frame.sum()

Ohio     24
Texas    28
Cal      32
Aa       36
dtype: int64

In [26]:
frame.sum(axis = 1)

a     6
b    22
c    38
d    54
dtype: int64

In [27]:
# 最大值索引
frame.idxmax()

Ohio     d
Texas    d
Cal      d
Aa       d
dtype: object

In [28]:
frame.idxmax(axis = 1)

a    Aa
b    Aa
c    Aa
d    Aa
dtype: object

In [29]:
frame.describe()

            Ohio      Texas        Cal         Aa
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [30]:
obj = Series(list('abcde') * 4)
obj

0     a
1     b
2     c
3     d
4     e
5     a
6     b
7     c
8     d
9     e
10    a
11    b
12    c
13    d
14    e
15    a
16    b
17    c
18    d
19    e
dtype: object

In [31]:
obj.describe()

count     20
unique     5
top        c
freq       4
dtype: object

### 相关系数与协方差

In [36]:
# import pandas.io.data as web
import datetime
import pandas_datareader.data as web

In [ ]:
# install package if import error
# !pip list
# !pip install pandas-datareader

In [39]:
start = datetime.datetime(2000, 1, 1) # or start = '1/1/2016' 
end = datetime.datetime(2001, 1, 1)
prices = web.DataReader('AAPL', 'yahoo', start, end)
print(prices.head()) # print first rows of the prices data

                High       Low      Open     Close       Volume  Adj Close
Date
1999-12-31  3.674107  3.553571  3.604911  3.671875   40952800.0   2.458919
2000-01-03  4.017857  3.631696  3.745536  3.997768  133949200.0   2.677157
2000-01-04  3.950893  3.613839  3.866071  3.660714  128094400.0   2.451444
2000-01-05  3.948661  3.678571  3.705357  3.714286  194580400.0   2.487319
2000-01-06  3.821429  3.392857  3.790179  3.392857  191993200.0   2.272070

In [40]:
prices.describe()

,High,Low,Open,Close,Volume,Adj Close
count,253.000000,253.000000,253.000000,253.000000,2.530000e+02,253.000000
mean,3.376978,3.171255,3.272089,3.266741,1.190370e+08,2.187615
std,1.233253,1.163433,1.190767,1.202516,1.323860e+08,0.805280
min,1.044643,0.973214,0.984371,1.000000,1.770720e+07,0.669663
25%,2.071429,1.812500,2.013393,1.839286,6.787760e+07,1.231701
50%,3.803571,3.584821,3.712054,3.687500,9.642640e+07,2.469382
75%,4.250000,4.020089,4.113839,4.102679,1.280944e+08,2.747411
max,5.370536,5.000000,5.087054,5.149554,1.855410e+09,3.448466

In [43]:
result = prices.pct_change()
result.tail()

                High       Low      Open     Close    Volume  Adj Close
Date
2000-12-22  0.000000  0.018018 -0.008772  0.066667 -0.133007   0.066666
2000-12-26  0.000000  0.008850  0.053097 -0.020833 -0.318303  -0.020833
2000-12-27 -0.012500 -0.004386 -0.035718  0.008511  0.501124   0.008511
2000-12-28  0.008439  0.008811  0.002182  0.000000 -0.062338   0.000000
2000-12-29  0.004184  0.013100  0.021739  0.004219  1.065473   0.004220

In [46]:
all_data = {}
for ticker in ['AAPL','IBM','MSFT','GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker, '1/1/2000', '1/1/2010')

AttributeError: 'dict' object has no attribute 'tail'

In [52]:
all_price = DataFrame({tic: data['Adj Close'] for tic,data in all_data.items()})
all_volume = DataFrame({tic: data['Volume'] for tic,data in all_data.items()})
print(all_price.tail())
print(all_volume.tail())

                 AAPL         IBM       MSFT        GOOG
Date
2009-12-24  19.998041  100.206764  24.760857  307.241699
2009-12-28  20.243908  101.542137  24.896641  309.422516
2009-12-29  20.003782  101.189095  25.072367  307.698730
2009-12-30  20.246777  101.741699  24.728914  309.352966
2009-12-31  20.159719  100.460022  24.345514  307.986847
                   AAPL        IBM        MSFT       GOOG
Date
2009-12-24  125222300.0  4265100.0  11083900.0  1728500.0
2009-12-28  161141400.0  5800400.0  25384000.0  3417800.0
2009-12-29  111301400.0  4184200.0  29716200.0  2868100.0
2009-12-30  103021100.0  3867000.0  42006200.0  2950200.0
2009-12-31   88102700.0  4223400.0  31929700.0  2455400.0

In [53]:
pct_returns = all_price.pct_change()
pct_returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034339  0.004385  0.002587  0.011117
2009-12-28  0.012295  0.013326  0.005484  0.007098
2009-12-29 -0.011862 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013698  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

#### Series 相关系数、协方差

In [54]:
pct_returns.MSFT.corr(pct_returns.IBM)

0.49253706494724375

In [55]:
pct_returns.MSFT.cov(pct_returns.IBM)

0.00021557771540279465

#### DataFrame 相关系数、协方差

In [56]:
pct_returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.412392  0.422852  0.470676
IBM   0.412392  1.000000  0.492537  0.390688
MSFT  0.422852  0.492537  1.000000  0.438313
GOOG  0.470676  0.390688  0.438313  1.000000

In [57]:
pct_returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001030  0.000254  0.000309  0.000303
IBM   0.000254  0.000369  0.000216  0.000142
MSFT  0.000309  0.000216  0.000519  0.000204
GOOG  0.000303  0.000142  0.000204  0.000580

In [58]:
pct_returns.corrwith(pct_returns.IBM)

AAPL    0.412392
IBM     1.000000
MSFT    0.492537
GOOG    0.390688
dtype: float64

In [61]:
pct_returns.to_csv('AAPL.csv')